#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/xapo/Xapo-Monitoring/runs/run-6qZGkogaxxZ6KXAt

Waiting for the plan to start...

Terraform v0.13.7
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.dashboard-prato-stg.data.external.rds: Refreshing state...
module.dashboard-allon-stg.data.external.elb: Refreshing state...
module.dashboard-allon-prod.data.external.redis: Refreshing state...
module.dashboard-allon-prod.data.external.elb: Refreshing state...
module.dashboard-alfred-stg.data.external.rds: Refreshing state...
module.dashboard-alfred-stg.data.external.elb: Refreshing state...
module.dashboard-profile-stg.data.external.app: Refreshing state...
module.dashboard-profile-stg.data.external.elb: Refreshing state...
module.dashboard-profile-stg.data.external.redis: Refreshing state...
module.dashboard-profile-stg.data.external.queues: Refreshing state...
module.dashboard-profile-stg.data.external.rds: Refreshing state...
module.dashboard-prato-prod.data.external.redis: Refreshing state...
module.dashboard-prato-prod.data.external.app: Refreshing state...
module.dashboard-alfred-prod.data.external.elb: Refreshing state...
module.dashboard-alfred-prod.data.external.app: Refreshing state...
module.dashboard-allon-stg.data.external.queues: Refreshing state...
module.dashboard-profile-prod.data.external.elb: Refreshing state...
module.dashboard-allon-prod.data.external.app: Refreshing state...
module.dashboard-allon-prod.data.external.queues: Refreshing state...
module.dashboard-prato-stg.data.external.redis: Refreshing state...
module.dashboard-profile-prod.data.external.app: Refreshing state...
module.dashboard-allon-stg.data.external.app: Refreshing state...
module.dashboard-alfred-prod.data.external.redis: Refreshing state...
module.dashboard-alfred-stg.data.external.queues: Refreshing state...
module.dashboard-profile-prod.data.external.queues: Refreshing state...
module.dashboard-alfred-prod.data.external.queues: Refreshing state...
module.dashboard-alfred-stg.data.external.app: Refreshing state...
module.dashboard-prato-prod.data.external.elb: Refreshing state...
module.dashboard-profile-prod.data.external.redis: Refreshing state...
module.dashboard-prato-stg.data.external.queues: Refreshing state...
module.dashboard-profile-prod.data.external.rds: Refreshing state...
module.dashboard-allon-stg.data.external.redis: Refreshing state...
module.dashboard-allon-prod.data.external.rds: Refreshing state...
module.dashboard-prato-prod.data.external.queues: Refreshing state...
module.dashboard-alfred-prod.data.external.rds: Refreshing state...
module.dashboard-alfred-stg.data.external.redis: Refreshing state...
module.dashboard-prato-prod.data.external.rds: Refreshing state...
module.dashboard-allon-stg.data.external.rds: Refreshing state...
module.dashboard-prato-stg.data.external.elb: Refreshing state...
module.dashboard-prato-stg.data.external.app: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_alert_policy.sre_policy will be created
  + resource "newrelic_alert_policy" "sre_policy" {
      + account_id          = (known after apply)
      + id                  = (known after apply)
      + incident_preference = "PER_POLICY"
      + name                = "SRE Critical TF"
    }

  # newrelic_alert_policy_channel.sre_policy will be created
  + resource "newrelic_alert_policy_channel" "sre_policy" {
      + channel_ids = [
          + 3994250,
          + 5188755,
        ]
      + id          = (known after apply)
      + policy_id   = (known after apply)
    }

  # newrelic_infra_alert_condition.Alb_5xx_global will be created
  + resource "newrelic_infra_alert_condition" "Alb_5xx_global" {
      + comparison            = "above"
      + created_at            = (known after apply)
      + description           = "Error if we got mor than 100 5xx errors at least 5 minutes"
      + enabled               = true
      + event                 = "LoadBalancerSample"
      + id                    = (known after apply)
      + integration_provider  = "alb"
      + name                  = "ALB 5xx - Global"
      + policy_id             = (known after apply)
      + select                = "provider.httpCodeBackend5XX.Sum"
      + type                  = "infra_metric"
      + updated_at            = (known after apply)
      + violation_close_timer = 8
      + where                 = "displayName LIKE '%prod%'"

      + critical {
          + duration      = 5
          + time_function = "all"
          + value         = 100
        }
    }

  # newrelic_infra_alert_condition.alb_4xx_global will be created
  + resource "newrelic_infra_alert_condition" "alb_4xx_global" {
      + comparison            = "above"
      + created_at            = (known after apply)
      + description           = "Error if we got mor thatn 400 4xx errors at least 5 minutes"
      + enabled               = true
      + event                 = "LoadBalancerSample"
      + id                    = (known after apply)
      + integration_provider  = "alb"
      + name                  = "ALB 4xx - Global"
      + policy_id             = (known after apply)
      + select                = "provider.httpCodeBackend4XX.Sum"
      + type                  = "infra_metric"
      + updated_at            = (known after apply)
      + violation_close_timer = 8
      + where                 = "displayName LIKE '%prod%'"

      + critical {
          + duration      = 5
          + time_function = "all"
          + value         = 400
        }
    }

  # newrelic_infra_alert_condition.alb_p99_global will be created
  + resource "newrelic_infra_alert_condition" "alb_p99_global" {
      + comparison            = "above"
      + created_at            = (known after apply)
      + description           = "Error if we got more than 10s latency at least 15 minutes"
      + enabled               = true
      + event                 = "LoadBalancerSample"
      + id                    = (known after apply)
      + integration_provider  = "alb"
      + name                  = "ALB p99 latency - Global"
      + policy_id             = (known after apply)
      + select                = "provider.latency.p99"
      + type                  = "infra_metric"
      + updated_at            = (known after apply)
      + violation_close_timer = 8
      + where                 = "displayName NOT LIKE '%staging%'"

      + critical {
          + duration      = 5
          + time_function = "all"
          + value         = 10
        }
    }

  # newrelic_infra_alert_condition.ecs_pending_task will be created
  + resource "newrelic_infra_alert_condition" "ecs_pending_task" {
      + comparison            = "above"
      + created_at            = (known after apply)
      + description           = "Number of pending task in 15 minutes"
      + enabled               = true
      + event                 = "ComputeSample"
      + id                    = (known after apply)
      + integration_provider  = "EcsCluster"
      + name                  = "ECS Pending count - Global"
      + policy_id             = (known after apply)
      + select                = "provider.pendingTasksCount"
      + type                  = "infra_metric"
      + updated_at            = (known after apply)
      + violation_close_timer = 8
      + where                 = "clusterName like '%prod%'"

      + critical {
          + duration      = 15
          + time_function = "all"
          + value         = 2
        }
    }

  # newrelic_infra_alert_condition.elb_4xx_global will be created
  + resource "newrelic_infra_alert_condition" "elb_4xx_global" {
      + comparison            = "above"
      + created_at            = (known after apply)
      + description           = "Error if we got mor thatn 400 4xx errors at least 5 minutes"
      + enabled               = true
      + event                 = "LoadBalancerSample"
      + id                    = (known after apply)
      + integration_provider  = "elb"
      + name                  = "ELB 4xx - Global"
      + policy_id             = (known after apply)
      + select                = "provider.httpCodeBackend4XX.Sum"
      + type                  = "infra_metric"
      + updated_at            = (known after apply)
      + violation_close_timer = 8
      + where                 = "displayName LIKE '%prod%'"

      + critical {
          + duration      = 5
          + time_function = "all"
          + value         = 400
        }
    }

  # newrelic_infra_alert_condition.elb_5xx_global will be created
  + resource "newrelic_infra_alert_condition" "elb_5xx_global" {
      + comparison            = "above"
      + created_at            = (known after apply)
      + description           = "Error if we got mor than 100 5xx errors at least 5 minutes"
      + enabled               = true
      + event                 = "LoadBalancerSample"
      + id                    = (known after apply)
      + integration_provider  = "elb"
      + name                  = "ELB 5xx - Global"
      + policy_id             = (known after apply)
      + select                = "provider.httpCodeBackend5XX.Sum"
      + type                  = "infra_metric"
      + updated_at            = (known after apply)
      + violation_close_timer = 8
      + where                 = "displayName LIKE '%prod%'"

      + critical {
          + duration      = 5
          + time_function = "all"
          + value         = 100
        }
    }

  # newrelic_infra_alert_condition.elb_p99_global will be created
  + resource "newrelic_infra_alert_condition" "elb_p99_global" {
      + comparison            = "above"
      + created_at            = (known after apply)
      + description           = "Error if we got more than 10s latency at least 15 minutes"
      + enabled               = true
      + event                 = "LoadBalancerSample"
      + id                    = (known after apply)
      + integration_provider  = "elb"
      + name                  = "ELB p99 latency - Global"
      + policy_id             = (known after apply)
      + select                = "provider.latency.p99"
      + type                  = "infra_metric"
      + updated_at            = (known after apply)
      + violation_close_timer = 8
      + where                 = "displayName NOT LIKE '%staging%' AND aws.elb.dnsName NOT LIKE '%finastra%'"

      + critical {
          + duration      = 5
          + time_function = "all"
          + value         = 10
        }
    }

  # newrelic_nrql_alert_condition.Apdex will be created
  + resource "newrelic_nrql_alert_condition" "Apdex" {
      + account_id                   = (known after apply)
      + aggregation_window           = 60
      + description                  = "Alert when apdex are too high"
      + enabled                      = true
      + id                           = (known after apply)
      + name                         = "Apdex - Global"
      + policy_id                    = (known after apply)
      + type                         = "static"
      + value_function               = "single_value"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 28800

      + critical {
          + operator              = "above"
          + threshold             = 3
          + threshold_duration    = 900
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = "SELECT average(`apm.service.apdex`) FROM Metric FACET appName WHERE tags.Environment = 'Production' AND appName LIKE '%'"
        }
    }

  # module.dashboard-alfred-prod.newrelic_one_dashboard.dashboard will be created
  + resource "newrelic_one_dashboard" "dashboard" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "SRE Terraform test Alfred Production"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "APM"

          + widget_area {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by time consumed - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(apm.service.datastore.operation.duration) * 1000 FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjg3NzIzMzQ')"
                }
            }
          + widget_area {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by average query time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(apm.service.datastore.operation.duration) * 1000  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjg3NzIzMzQ')"
                }
            }
          + widget_area {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions by percent of wall clock time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(sum(apm.service.transaction.duration), 1 second) * 100  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjg3NzIzMzQ')"
                }
            }
          + widget_area {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(apm.service.transaction.duration) FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjg3NzIzMzQ')"
                }
            }

          + widget_bar {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Transaction Errors List - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(aggregateFacet) FROM TransactionError FACET aggregateFacet, appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjg3NzIzMzQ')"
                }
            }

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction throughput - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.duration), 1 minute) as 'Web throughput' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjg3NzIzMzQ')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction Errors - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.error.count), 1 minute) as 'errors' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjg3NzIzMzQ')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Database"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU Usage - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQ5MDQ0ODcyODIyMDMyNDI4MTY', 'ODA5NTUxfElORlJBfE5BfDQ5NzAzMTQ2NzI2MzU5MzI5Njk')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Memory - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT min(provider.freeableMemoryBytes.Minimum) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQ5MDQ0ODcyODIyMDMyNDI4MTY', 'ODA5NTUxfElORlJBfE5BfDQ5NzAzMTQ2NzI2MzU5MzI5Njk')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "IOPs - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.readIops.Average) as 'Read', average(provider.writeIops.Average) as 'Write' from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQ5MDQ0ODcyODIyMDMyNDI4MTY', 'ODA5NTUxfElORlJBfE5BfDQ5NzAzMTQ2NzI2MzU5MzI5Njk')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Disk Space - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.freeStorageSpace.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQ5MDQ0ODcyODIyMDMyNDI4MTY', 'ODA5NTUxfElORlJBfE5BfDQ5NzAzMTQ2NzI2MzU5MzI5Njk')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "ELB"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Request - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.requestCount.Sum) FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDM1NDAyODk1OTQ5ODkyMTg4MQ', 'ODA5NTUxfElORlJBfE5BfDkxNTkzOTU0MzE1MDUzNDQ3NTI')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Backend Errors - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.httpCodeBackend4XX.Sum) as '4xx errors', sum(provider.httpCodeBackend5XX.Sum) as '5xx errors' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDM1NDAyODk1OTQ5ODkyMTg4MQ', 'ODA5NTUxfElORlJBfE5BfDkxNTkzOTU0MzE1MDUzNDQ3NTI')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Latency - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.latency.Average) as 'Latency (s)' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDM1NDAyODk1OTQ5ODkyMTg4MQ', 'ODA5NTUxfElORlJBfE5BfDkxNTkzOTU0MzE1MDUzNDQ3NTI')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "unhealthyHostCount - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.unhealthyHostCount.Average ) as 'Unhealthy hosts' FROM LoadBalancerSample FACET displayName WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDM1NDAyODk1OTQ5ODkyMTg4MQ', 'ODA5NTUxfElORlJBfE5BfDkxNTkzOTU0MzE1MDUzNDQ3NTI')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "SQS"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Messages available - SQS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.approximateNumberOfMessagesVisible.Maximum) from QueueSample FACET provider.queueName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDcwODgzODkwMTUzMzAxNjQxODU', 'ODA5NTUxfElORlJBfE5BfDcxMTA5MTQ2NjkxNDI3NTQyNzQ')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Cache"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) as 'CPU utilization (%)' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfC0yMTM3NzA0MDEwODA3NzExNDkx', 'ODA5NTUxfElORlJBfE5BfC01NjczODM0NzYyMjQ5NDQ4MDk0')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "ITEMS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currItems.Average ) as 'Current' , average( provider.evictions.Average ) as 'Evicted', average( provider.reclaimed.Average ) as 'Reclaimed' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfC0yMTM3NzA0MDEwODA3NzExNDkx', 'ODA5NTUxfElORlJBfE5BfC01NjczODM0NzYyMjQ5NDQ4MDk0')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "HIT / MISS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cacheHits.Average) as 'Hits', average(provider.cacheMisses.Average) as 'Misses' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfC0yMTM3NzA0MDEwODA3NzExNDkx', 'ODA5NTUxfElORlJBfE5BfC01NjczODM0NzYyMjQ5NDQ4MDk0')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Clients - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currConnections.Average ) as 'Current', average( provider.newConnections.Average ) as 'New' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfC0yMTM3NzA0MDEwODA3NzExNDkx', 'ODA5NTUxfElORlJBfE5BfC01NjczODM0NzYyMjQ5NDQ4MDk0')"
                }
            }
          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Memory - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.bytesUsedForCache.Average ) as 'Used', average( provider.freeableMemory.Average ) as 'Free', average( provider.swapUsage.Average ) as 'Swap' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfC0yMTM3NzA0MDEwODA3NzExNDkx', 'ODA5NTUxfElORlJBfE5BfC01NjczODM0NzYyMjQ5NDQ4MDk0')"
                }
            }
        }
    }

  # module.dashboard-alfred-stg.newrelic_one_dashboard.dashboard will be created
  + resource "newrelic_one_dashboard" "dashboard" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "SRE Terraform test Alfred Staging"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "APM"

          + widget_area {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by time consumed - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(apm.service.datastore.operation.duration) * 1000 FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwyNjQzNTc4NTk')"
                }
            }
          + widget_area {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by average query time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(apm.service.datastore.operation.duration) * 1000  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwyNjQzNTc4NTk')"
                }
            }
          + widget_area {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions by percent of wall clock time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(sum(apm.service.transaction.duration), 1 second) * 100  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwyNjQzNTc4NTk')"
                }
            }
          + widget_area {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(apm.service.transaction.duration) FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwyNjQzNTc4NTk')"
                }
            }

          + widget_bar {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Transaction Errors List - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(aggregateFacet) FROM TransactionError FACET aggregateFacet, appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwyNjQzNTc4NTk')"
                }
            }

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction throughput - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.duration), 1 minute) as 'Web throughput' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwyNjQzNTc4NTk')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction Errors - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.error.count), 1 minute) as 'errors' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwyNjQzNTc4NTk')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Database"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU Usage - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQ4MzA0Njk4MjIxMjczMTQ3Nzk')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Memory - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT min(provider.freeableMemoryBytes.Minimum) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQ4MzA0Njk4MjIxMjczMTQ3Nzk')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "IOPs - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.readIops.Average) as 'Read', average(provider.writeIops.Average) as 'Write' from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQ4MzA0Njk4MjIxMjczMTQ3Nzk')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Disk Space - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.freeStorageSpace.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQ4MzA0Njk4MjIxMjczMTQ3Nzk')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "ELB"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Request - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.requestCount.Sum) FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Backend Errors - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.httpCodeBackend4XX.Sum) as '4xx errors', sum(provider.httpCodeBackend5XX.Sum) as '5xx errors' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Latency - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.latency.Average) as 'Latency (s)' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "unhealthyHostCount - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.unhealthyHostCount.Average ) as 'Unhealthy hosts' FROM LoadBalancerSample FACET displayName WHERE entityGuid IN ()"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "SQS"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Messages available - SQS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.approximateNumberOfMessagesVisible.Maximum) from QueueSample FACET provider.queueName TIMESERIES WHERE entityGuid in ()"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Cache"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) as 'CPU utilization (%)' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDY0NDQ3MjgxNDIwMzE2Nzk4ODI')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "ITEMS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currItems.Average ) as 'Current' , average( provider.evictions.Average ) as 'Evicted', average( provider.reclaimed.Average ) as 'Reclaimed' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDY0NDQ3MjgxNDIwMzE2Nzk4ODI')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "HIT / MISS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cacheHits.Average) as 'Hits', average(provider.cacheMisses.Average) as 'Misses' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDY0NDQ3MjgxNDIwMzE2Nzk4ODI')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Clients - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currConnections.Average ) as 'Current', average( provider.newConnections.Average ) as 'New' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDY0NDQ3MjgxNDIwMzE2Nzk4ODI')"
                }
            }
          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Memory - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.bytesUsedForCache.Average ) as 'Used', average( provider.freeableMemory.Average ) as 'Free', average( provider.swapUsage.Average ) as 'Swap' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDY0NDQ3MjgxNDIwMzE2Nzk4ODI')"
                }
            }
        }
    }

  # module.dashboard-allon-prod.newrelic_one_dashboard.dashboard will be created
  + resource "newrelic_one_dashboard" "dashboard" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "SRE Terraform test Allon Production"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "APM"

          + widget_area {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by time consumed - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(apm.service.datastore.operation.duration) * 1000 FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMzY1NDEzMDg')"
                }
            }
          + widget_area {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by average query time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(apm.service.datastore.operation.duration) * 1000  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMzY1NDEzMDg')"
                }
            }
          + widget_area {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions by percent of wall clock time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(sum(apm.service.transaction.duration), 1 second) * 100  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMzY1NDEzMDg')"
                }
            }
          + widget_area {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(apm.service.transaction.duration) FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMzY1NDEzMDg')"
                }
            }

          + widget_bar {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Transaction Errors List - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(aggregateFacet) FROM TransactionError FACET aggregateFacet, appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMzY1NDEzMDg')"
                }
            }

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction throughput - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.duration), 1 minute) as 'Web throughput' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMzY1NDEzMDg')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction Errors - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.error.count), 1 minute) as 'errors' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMzY1NDEzMDg')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Database"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU Usage - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDcwMDc1NjY1NDAwMDI1MzM5Mjc')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Memory - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT min(provider.freeableMemoryBytes.Minimum) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDcwMDc1NjY1NDAwMDI1MzM5Mjc')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "IOPs - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.readIops.Average) as 'Read', average(provider.writeIops.Average) as 'Write' from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDcwMDc1NjY1NDAwMDI1MzM5Mjc')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Disk Space - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.freeStorageSpace.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDcwMDc1NjY1NDAwMDI1MzM5Mjc')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "ELB"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Request - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.requestCount.Sum) FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDc0ODEzNDc1Njk4NTk3MDk0OTA', 'ODA5NTUxfElORlJBfE5BfDkwNDA2Mzg2MjIyMzc5MTAxNw', 'ODA5NTUxfElORlJBfE5BfDQ2NTY2NTY4MjA0MTAxODg5OTE')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Backend Errors - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.httpCodeBackend4XX.Sum) as '4xx errors', sum(provider.httpCodeBackend5XX.Sum) as '5xx errors' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDc0ODEzNDc1Njk4NTk3MDk0OTA', 'ODA5NTUxfElORlJBfE5BfDkwNDA2Mzg2MjIyMzc5MTAxNw', 'ODA5NTUxfElORlJBfE5BfDQ2NTY2NTY4MjA0MTAxODg5OTE')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Latency - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.latency.Average) as 'Latency (s)' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDc0ODEzNDc1Njk4NTk3MDk0OTA', 'ODA5NTUxfElORlJBfE5BfDkwNDA2Mzg2MjIyMzc5MTAxNw', 'ODA5NTUxfElORlJBfE5BfDQ2NTY2NTY4MjA0MTAxODg5OTE')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "unhealthyHostCount - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.unhealthyHostCount.Average ) as 'Unhealthy hosts' FROM LoadBalancerSample FACET displayName WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDc0ODEzNDc1Njk4NTk3MDk0OTA', 'ODA5NTUxfElORlJBfE5BfDkwNDA2Mzg2MjIyMzc5MTAxNw', 'ODA5NTUxfElORlJBfE5BfDQ2NTY2NTY4MjA0MTAxODg5OTE')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Cache"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) as 'CPU utilization (%)' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMxNzYyODkyOTUwMTE1NTk5NDU', 'ODA5NTUxfElORlJBfE5BfDQ1ODYzOTMwMDU1NjcyMDQ4ODY')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "ITEMS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currItems.Average ) as 'Current' , average( provider.evictions.Average ) as 'Evicted', average( provider.reclaimed.Average ) as 'Reclaimed' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMxNzYyODkyOTUwMTE1NTk5NDU', 'ODA5NTUxfElORlJBfE5BfDQ1ODYzOTMwMDU1NjcyMDQ4ODY')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "HIT / MISS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cacheHits.Average) as 'Hits', average(provider.cacheMisses.Average) as 'Misses' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMxNzYyODkyOTUwMTE1NTk5NDU', 'ODA5NTUxfElORlJBfE5BfDQ1ODYzOTMwMDU1NjcyMDQ4ODY')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Clients - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currConnections.Average ) as 'Current', average( provider.newConnections.Average ) as 'New' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMxNzYyODkyOTUwMTE1NTk5NDU', 'ODA5NTUxfElORlJBfE5BfDQ1ODYzOTMwMDU1NjcyMDQ4ODY')"
                }
            }
          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Memory - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.bytesUsedForCache.Average ) as 'Used', average( provider.freeableMemory.Average ) as 'Free', average( provider.swapUsage.Average ) as 'Swap' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMxNzYyODkyOTUwMTE1NTk5NDU', 'ODA5NTUxfElORlJBfE5BfDQ1ODYzOTMwMDU1NjcyMDQ4ODY')"
                }
            }
        }
    }

  # module.dashboard-allon-stg.newrelic_one_dashboard.dashboard will be created
  + resource "newrelic_one_dashboard" "dashboard" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "SRE Terraform test Allon Staging"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "APM"

          + widget_area {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by time consumed - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(apm.service.datastore.operation.duration) * 1000 FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjU0NDI5NTU')"
                }
            }
          + widget_area {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by average query time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(apm.service.datastore.operation.duration) * 1000  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjU0NDI5NTU')"
                }
            }
          + widget_area {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions by percent of wall clock time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(sum(apm.service.transaction.duration), 1 second) * 100  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjU0NDI5NTU')"
                }
            }
          + widget_area {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(apm.service.transaction.duration) FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjU0NDI5NTU')"
                }
            }

          + widget_bar {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Transaction Errors List - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(aggregateFacet) FROM TransactionError FACET aggregateFacet, appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjU0NDI5NTU')"
                }
            }

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction throughput - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.duration), 1 minute) as 'Web throughput' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjU0NDI5NTU')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction Errors - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.error.count), 1 minute) as 'errors' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzMjU0NDI5NTU')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Database"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU Usage - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDEwMjk4NzQxOTQxNDI0MzMyMjY')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Memory - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT min(provider.freeableMemoryBytes.Minimum) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDEwMjk4NzQxOTQxNDI0MzMyMjY')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "IOPs - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.readIops.Average) as 'Read', average(provider.writeIops.Average) as 'Write' from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDEwMjk4NzQxOTQxNDI0MzMyMjY')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Disk Space - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.freeStorageSpace.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDEwMjk4NzQxOTQxNDI0MzMyMjY')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "ELB"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Request - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.requestCount.Sum) FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Backend Errors - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.httpCodeBackend4XX.Sum) as '4xx errors', sum(provider.httpCodeBackend5XX.Sum) as '5xx errors' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Latency - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.latency.Average) as 'Latency (s)' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "unhealthyHostCount - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.unhealthyHostCount.Average ) as 'Unhealthy hosts' FROM LoadBalancerSample FACET displayName WHERE entityGuid IN ()"
                }
            }
        }
    }

  # module.dashboard-prato-prod.newrelic_one_dashboard.dashboard will be created
  + resource "newrelic_one_dashboard" "dashboard" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "SRE Terraform test Prato Production"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "APM"

          + widget_area {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by time consumed - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(apm.service.datastore.operation.duration) * 1000 FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw0MTg4NzczMTU')"
                }
            }
          + widget_area {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by average query time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(apm.service.datastore.operation.duration) * 1000  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw0MTg4NzczMTU')"
                }
            }
          + widget_area {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions by percent of wall clock time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(sum(apm.service.transaction.duration), 1 second) * 100  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw0MTg4NzczMTU')"
                }
            }
          + widget_area {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(apm.service.transaction.duration) FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw0MTg4NzczMTU')"
                }
            }

          + widget_bar {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Transaction Errors List - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(aggregateFacet) FROM TransactionError FACET aggregateFacet, appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw0MTg4NzczMTU')"
                }
            }

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction throughput - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.duration), 1 minute) as 'Web throughput' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw0MTg4NzczMTU')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction Errors - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.error.count), 1 minute) as 'errors' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw0MTg4NzczMTU')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Database"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU Usage - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMTEzNDgxMjM0OTk1ODE3NTA', 'ODA5NTUxfElORlJBfE5BfDc2MDE4NTQ0MTEzMDExNjI5Njg')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Memory - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT min(provider.freeableMemoryBytes.Minimum) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMTEzNDgxMjM0OTk1ODE3NTA', 'ODA5NTUxfElORlJBfE5BfDc2MDE4NTQ0MTEzMDExNjI5Njg')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "IOPs - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.readIops.Average) as 'Read', average(provider.writeIops.Average) as 'Write' from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMTEzNDgxMjM0OTk1ODE3NTA', 'ODA5NTUxfElORlJBfE5BfDc2MDE4NTQ0MTEzMDExNjI5Njg')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Disk Space - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.freeStorageSpace.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMTEzNDgxMjM0OTk1ODE3NTA', 'ODA5NTUxfElORlJBfE5BfDc2MDE4NTQ0MTEzMDExNjI5Njg')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "ELB"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Request - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.requestCount.Sum) FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDYxODE4NTc2MDYyMzQ0NDUxMTU', 'ODA5NTUxfElORlJBfE5BfDExMjM4NjM1MzAyNTUyMTI2NTA', 'ODA5NTUxfElORlJBfE5BfDY1NzUwODMxMTUyNzQzMDY3Mzk', 'ODA5NTUxfElORlJBfE5BfDg2MjE3OTcwMDU5MDM4NTcwMDA', 'ODA5NTUxfElORlJBfE5BfDczMTc4ODE5ODgzNDUyNDcwMjg')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Backend Errors - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.httpCodeBackend4XX.Sum) as '4xx errors', sum(provider.httpCodeBackend5XX.Sum) as '5xx errors' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDYxODE4NTc2MDYyMzQ0NDUxMTU', 'ODA5NTUxfElORlJBfE5BfDExMjM4NjM1MzAyNTUyMTI2NTA', 'ODA5NTUxfElORlJBfE5BfDY1NzUwODMxMTUyNzQzMDY3Mzk', 'ODA5NTUxfElORlJBfE5BfDg2MjE3OTcwMDU5MDM4NTcwMDA', 'ODA5NTUxfElORlJBfE5BfDczMTc4ODE5ODgzNDUyNDcwMjg')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Latency - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.latency.Average) as 'Latency (s)' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDYxODE4NTc2MDYyMzQ0NDUxMTU', 'ODA5NTUxfElORlJBfE5BfDExMjM4NjM1MzAyNTUyMTI2NTA', 'ODA5NTUxfElORlJBfE5BfDY1NzUwODMxMTUyNzQzMDY3Mzk', 'ODA5NTUxfElORlJBfE5BfDg2MjE3OTcwMDU5MDM4NTcwMDA', 'ODA5NTUxfElORlJBfE5BfDczMTc4ODE5ODgzNDUyNDcwMjg')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "unhealthyHostCount - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.unhealthyHostCount.Average ) as 'Unhealthy hosts' FROM LoadBalancerSample FACET displayName WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDYxODE4NTc2MDYyMzQ0NDUxMTU', 'ODA5NTUxfElORlJBfE5BfDExMjM4NjM1MzAyNTUyMTI2NTA', 'ODA5NTUxfElORlJBfE5BfDY1NzUwODMxMTUyNzQzMDY3Mzk', 'ODA5NTUxfElORlJBfE5BfDg2MjE3OTcwMDU5MDM4NTcwMDA', 'ODA5NTUxfElORlJBfE5BfDczMTc4ODE5ODgzNDUyNDcwMjg')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "SQS"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Messages available - SQS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.approximateNumberOfMessagesVisible.Maximum) from QueueSample FACET provider.queueName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDEwNTA0NjYxMTI2NDg0MzYwNTg', 'ODA5NTUxfElORlJBfE5BfDYwODAyMzM0NDgyMjI1NjA0NjE', 'ODA5NTUxfElORlJBfE5BfDI4MDc1NDQwMzY0NzgzOTgyNzY', 'ODA5NTUxfElORlJBfE5BfDI1MTUxNjAyNjUwMzI0OTc5Nzg', 'ODA5NTUxfElORlJBfE5BfDU4MDYxODY4NDc1MzA5Mjg3Ng', 'ODA5NTUxfElORlJBfE5BfDc4MzA3MjY4MjAyNTM2MzM4NTE', 'ODA5NTUxfElORlJBfE5BfDIyMjA2NDAxNTg4ODE0OTEyMzM', 'ODA5NTUxfElORlJBfE5BfDQ4MDc0MTcwNDUwNjk4MDUzNTA', 'ODA5NTUxfElORlJBfE5BfDQ2NjMwNjczNjY3NzM5MjAzNzk', 'ODA5NTUxfElORlJBfE5BfDQ5NTQ2MDU4MDkzMTA3MjgyMjg', 'ODA5NTUxfElORlJBfE5BfDMzODA3MDI0MDk4MTA3NjY1MTg', 'ODA5NTUxfElORlJBfE5BfDMyNjI5Mzk2NzU1MjcyMTk1Mjg')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Cache"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) as 'CPU utilization (%)' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMzExNTkxNjg4NzE3NDUzNDA', 'ODA5NTUxfElORlJBfE5BfDQ2MjkxNzIwODcyMzI5MTgyODM', 'ODA5NTUxfElORlJBfE5BfDUyNDQwNzA0NzUyNzg5MzQyOTU', 'ODA5NTUxfElORlJBfE5BfDQ1NzQ1NjAwNzU4NjY4MjM0MQ')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "ITEMS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currItems.Average ) as 'Current' , average( provider.evictions.Average ) as 'Evicted', average( provider.reclaimed.Average ) as 'Reclaimed' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMzExNTkxNjg4NzE3NDUzNDA', 'ODA5NTUxfElORlJBfE5BfDQ2MjkxNzIwODcyMzI5MTgyODM', 'ODA5NTUxfElORlJBfE5BfDUyNDQwNzA0NzUyNzg5MzQyOTU', 'ODA5NTUxfElORlJBfE5BfDQ1NzQ1NjAwNzU4NjY4MjM0MQ')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "HIT / MISS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cacheHits.Average) as 'Hits', average(provider.cacheMisses.Average) as 'Misses' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMzExNTkxNjg4NzE3NDUzNDA', 'ODA5NTUxfElORlJBfE5BfDQ2MjkxNzIwODcyMzI5MTgyODM', 'ODA5NTUxfElORlJBfE5BfDUyNDQwNzA0NzUyNzg5MzQyOTU', 'ODA5NTUxfElORlJBfE5BfDQ1NzQ1NjAwNzU4NjY4MjM0MQ')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Clients - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currConnections.Average ) as 'Current', average( provider.newConnections.Average ) as 'New' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMzExNTkxNjg4NzE3NDUzNDA', 'ODA5NTUxfElORlJBfE5BfDQ2MjkxNzIwODcyMzI5MTgyODM', 'ODA5NTUxfElORlJBfE5BfDUyNDQwNzA0NzUyNzg5MzQyOTU', 'ODA5NTUxfElORlJBfE5BfDQ1NzQ1NjAwNzU4NjY4MjM0MQ')"
                }
            }
          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Memory - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.bytesUsedForCache.Average ) as 'Used', average( provider.freeableMemory.Average ) as 'Free', average( provider.swapUsage.Average ) as 'Swap' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDMyMzExNTkxNjg4NzE3NDUzNDA', 'ODA5NTUxfElORlJBfE5BfDQ2MjkxNzIwODcyMzI5MTgyODM', 'ODA5NTUxfElORlJBfE5BfDUyNDQwNzA0NzUyNzg5MzQyOTU', 'ODA5NTUxfElORlJBfE5BfDQ1NzQ1NjAwNzU4NjY4MjM0MQ')"
                }
            }
        }
    }

  # module.dashboard-prato-stg.newrelic_one_dashboard.dashboard will be created
  + resource "newrelic_one_dashboard" "dashboard" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "SRE Terraform test Prato Staging"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "APM"

          + widget_area {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by time consumed - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(apm.service.datastore.operation.duration) * 1000 FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzOTU4NjkxOTc')"
                }
            }
          + widget_area {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by average query time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(apm.service.datastore.operation.duration) * 1000  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzOTU4NjkxOTc')"
                }
            }
          + widget_area {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions by percent of wall clock time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(sum(apm.service.transaction.duration), 1 second) * 100  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzOTU4NjkxOTc')"
                }
            }
          + widget_area {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(apm.service.transaction.duration) FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzOTU4NjkxOTc')"
                }
            }

          + widget_bar {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Transaction Errors List - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(aggregateFacet) FROM TransactionError FACET aggregateFacet, appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzOTU4NjkxOTc')"
                }
            }

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction throughput - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.duration), 1 minute) as 'Web throughput' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzOTU4NjkxOTc')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction Errors - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.error.count), 1 minute) as 'errors' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnwzOTU4NjkxOTc')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Database"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU Usage - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDk5ODQxODE1NDE4NTUxNzAxMQ')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Memory - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT min(provider.freeableMemoryBytes.Minimum) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDk5ODQxODE1NDE4NTUxNzAxMQ')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "IOPs - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.readIops.Average) as 'Read', average(provider.writeIops.Average) as 'Write' from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDk5ODQxODE1NDE4NTUxNzAxMQ')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Free Disk Space - RDS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.freeStorageSpace.Average) from DatastoreSample facet displayName TIMESERIES  WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDk5ODQxODE1NDE4NTUxNzAxMQ')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "ELB"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Request - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.requestCount.Sum) FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Backend Errors - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.httpCodeBackend4XX.Sum) as '4xx errors', sum(provider.httpCodeBackend5XX.Sum) as '5xx errors' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Latency - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.latency.Average) as 'Latency (s)' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "unhealthyHostCount - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.unhealthyHostCount.Average ) as 'Unhealthy hosts' FROM LoadBalancerSample FACET displayName WHERE entityGuid IN ()"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "SQS"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Messages available - SQS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.approximateNumberOfMessagesVisible.Maximum) from QueueSample FACET provider.queueName TIMESERIES WHERE entityGuid in ()"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "Cache"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "CPU - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cpuUtilization.Average) as 'CPU utilization (%)' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQxMjQwNTYzNzY4NDY0MTQyMjI', 'ODA5NTUxfElORlJBfE5BfDQyODQyNTQwNzY0ODQwODEzODQ')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "ITEMS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currItems.Average ) as 'Current' , average( provider.evictions.Average ) as 'Evicted', average( provider.reclaimed.Average ) as 'Reclaimed' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQxMjQwNTYzNzY4NDY0MTQyMjI', 'ODA5NTUxfElORlJBfE5BfDQyODQyNTQwNzY0ODQwODEzODQ')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "HIT / MISS - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.cacheHits.Average) as 'Hits', average(provider.cacheMisses.Average) as 'Misses' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQxMjQwNTYzNzY4NDY0MTQyMjI', 'ODA5NTUxfElORlJBfE5BfDQyODQyNTQwNzY0ODQwODEzODQ')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Clients - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.currConnections.Average ) as 'Current', average( provider.newConnections.Average ) as 'New' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQxMjQwNTYzNzY4NDY0MTQyMjI', 'ODA5NTUxfElORlJBfE5BfDQyODQyNTQwNzY0ODQwODEzODQ')"
                }
            }
          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Memory - REDIS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.bytesUsedForCache.Average ) as 'Used', average( provider.freeableMemory.Average ) as 'Free', average( provider.swapUsage.Average ) as 'Swap' FROM DatastoreSample FACET entityName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDQxMjQwNTYzNzY4NDY0MTQyMjI', 'ODA5NTUxfElORlJBfE5BfDQyODQyNTQwNzY0ODQwODEzODQ')"
                }
            }
        }
    }

  # module.dashboard-profile-prod.newrelic_one_dashboard.dashboard will be created
  + resource "newrelic_one_dashboard" "dashboard" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "SRE Terraform test Profile Production"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "APM"

          + widget_area {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by time consumed - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(apm.service.datastore.operation.duration) * 1000 FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NzYwODE4Mw')"
                }
            }
          + widget_area {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by average query time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(apm.service.datastore.operation.duration) * 1000  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NzYwODE4Mw')"
                }
            }
          + widget_area {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions by percent of wall clock time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(sum(apm.service.transaction.duration), 1 second) * 100  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NzYwODE4Mw')"
                }
            }
          + widget_area {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(apm.service.transaction.duration) FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NzYwODE4Mw')"
                }
            }

          + widget_bar {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Transaction Errors List - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(aggregateFacet) FROM TransactionError FACET aggregateFacet, appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NzYwODE4Mw')"
                }
            }

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction throughput - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.duration), 1 minute) as 'Web throughput' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NzYwODE4Mw')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction Errors - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.error.count), 1 minute) as 'errors' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NzYwODE4Mw')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "ELB"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Request - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.requestCount.Sum) FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDc1NTA5MTUwMDYyMzcxMzA0NDA')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Backend Errors - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.httpCodeBackend4XX.Sum) as '4xx errors', sum(provider.httpCodeBackend5XX.Sum) as '5xx errors' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDc1NTA5MTUwMDYyMzcxMzA0NDA')"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Latency - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.latency.Average) as 'Latency (s)' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDc1NTA5MTUwMDYyMzcxMzA0NDA')"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "unhealthyHostCount - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.unhealthyHostCount.Average ) as 'Unhealthy hosts' FROM LoadBalancerSample FACET displayName WHERE entityGuid IN ('ODA5NTUxfElORlJBfE5BfDc1NTA5MTUwMDYyMzcxMzA0NDA')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "SQS"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Messages available - SQS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.approximateNumberOfMessagesVisible.Maximum) from QueueSample FACET provider.queueName TIMESERIES WHERE entityGuid in ('ODA5NTUxfElORlJBfE5BfDY5Njg3NTYyMjAzODQ0MTA1MTA', 'ODA5NTUxfElORlJBfE5BfDI1NTIyNjcwNzk0Njk3MjI2OTY', 'ODA5NTUxfElORlJBfE5BfDY3NTY4NDMwNjE1NzU0NzMyMjM', 'ODA5NTUxfElORlJBfE5BfDUxNjAzMzQ3MDMxODIzNTk4MjA', 'ODA5NTUxfElORlJBfE5BfDc0MzMzMzIwNDA4MjI2NTU3OTg', 'ODA5NTUxfElORlJBfE5BfDY0Nzk0NTg0OTY2MzYzODUxMw')"
                }
            }
        }
    }

  # module.dashboard-profile-stg.newrelic_one_dashboard.dashboard will be created
  + resource "newrelic_one_dashboard" "dashboard" {
      + account_id  = (known after apply)
      + guid        = (known after apply)
      + id          = (known after apply)
      + name        = "SRE Terraform test Profile Staging"
      + permalink   = (known after apply)
      + permissions = "public_read_only"

      + page {
          + guid = (known after apply)
          + name = "APM"

          + widget_area {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by time consumed - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(apm.service.datastore.operation.duration) * 1000 FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NjYwNjUyMw')"
                }
            }
          + widget_area {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Top Database Operations by average query time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(apm.service.datastore.operation.duration) * 1000  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NjYwNjUyMw')"
                }
            }
          + widget_area {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions by percent of wall clock time - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(sum(apm.service.transaction.duration), 1 second) * 100  FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NjYwNjUyMw')"
                }
            }
          + widget_area {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Top transactions - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(apm.service.transaction.duration) FROM Metric TIMESERIES  facet appName, metricTimesliceName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NjYwNjUyMw')"
                }
            }

          + widget_bar {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 2
              + title  = "Transaction Errors List - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT count(aggregateFacet) FROM TransactionError FACET aggregateFacet, appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NjYwNjUyMw')"
                }
            }

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction throughput - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.duration), 1 minute) as 'Web throughput' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NjYwNjUyMw')"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Transaction Errors - APM"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT rate(count(apm.service.transaction.error.count), 1 minute) as 'errors' FROM Metric TIMESERIES  facet appName WHERE entity.guid IN ('ODA5NTUxfEFQTXxBUFBMSUNBVElPTnw3NjYwNjUyMw')"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "ELB"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Request - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.requestCount.Sum) FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 4
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Backend Errors - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT sum(provider.httpCodeBackend4XX.Sum) as '4xx errors', sum(provider.httpCodeBackend5XX.Sum) as '5xx errors' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 7
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Latency - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.latency.Average) as 'Latency (s)' FROM LoadBalancerSample FACET displayName TIMESERIES WHERE entityGuid IN ()"
                }
            }
          + widget_line {
              + column = 10
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "unhealthyHostCount - ELB"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average( provider.unhealthyHostCount.Average ) as 'Unhealthy hosts' FROM LoadBalancerSample FACET displayName WHERE entityGuid IN ()"
                }
            }
        }
      + page {
          + guid = (known after apply)
          + name = "SQS"

          + widget_line {
              + column = 1
              + height = 3
              + id     = (known after apply)
              + row    = 1
              + title  = "Messages available - SQS"
              + width  = 3

              + nrql_query {
                  + account_id = (known after apply)
                  + query      = "SELECT average(provider.approximateNumberOfMessagesVisible.Maximum) from QueueSample FACET provider.queueName TIMESERIES WHERE entityGuid in ()"
                }
            }
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @csepulveda, Action: `pull_request`*